## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_dashboard.service_dashboard[0] will be updated in-place
  ~ resource "datadog_dashboard" "service_dashboard" {
        id                      = "4jj-dh7-k8z"
        tags                    = []
        # (9 unchanged attributes hidden)

      ~ template_variable {
-           default          = "production" -> null
          ~ defaults         = [
+               "production",
            ]
            name             = "env"
            # (2 unchanged attributes hidden)
        }
      ~ template_variable {
-           default          = "grants-ingest" -> null
          ~ defaults         = [
+               "grants-ingest",
            ]
            name             = "service"
            # (2 unchanged attributes hidden)
        }
      ~ template_variable {
-           default          = "*" -> null
          ~ defaults         = [
+               "*",
            ]
            name             = "version"
            # (2 unchanged attributes hidden)
        }

      ~ widget {
            id = 7901641667218607

          ~ widget_layout {
              ~ height          = 7 -> 6
                # (4 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 927772671170127

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 7 -> 6
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 8344517606750520

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 11 -> 9
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 8585438472288296

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 15 -> 12
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 7900811765392246

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 19 -> 15
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 927960004593997

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 23 -> 18
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 4802434584466019

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 27 -> 21
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 6158595272184427

          ~ widget_layout {
              ~ height          = 7 -> 6
              ~ y               = 31 -> 24
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 4265942953997714

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 717504082407424

                  ~ widget_layout {
                      ~ height          = 17 -> 13
                        # (4 unchanged attributes hidden)
                    }

                    # (1 unchanged block hidden)
                }
              ~ widget {
                    id = 8631204614732087

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ formula {
-                               alias              = "Published" -> null
                                # (1 unchanged attribute hidden)
                            }

-                           style {
-                               line_type  = "solid" -> null
-                               line_width = "normal" -> null
-                               palette    = "dog_classic" -> null
                            }

                            # (1 unchanged block hidden)
                        }
-                       request {
-                           display_type   = "line" -> null
-                           on_right_yaxis = false -> null

-                           formula {
-                               alias              = "Rolling Total" -> null
-                               formula_expression = "cumsum(query0)" -> null
                            }

-                           query {
-                               metric_query {
-                                   data_source = "metrics" -> null
-                                   name        = "query0" -> null
-                                   query       = "sum:grants_ingest.PublishGrantEvents.event.published{$env,$service,$version}.as_count()" -> null
                                }
                            }

-                           style {
-                               line_type  = "solid" -> null
-                               line_width = "normal" -> null
-                               palette    = "dog_classic" -> null
                            }
                        }

-                       yaxis {
-                           include_zero = false -> null
-                           scale        = "linear" -> null
                        }
                    }

                    # (1 unchanged block hidden)
                }
-               widget {
-                   id = 1246366124358846 -> null

-                   timeseries_definition {
-                       legend_columns = [
-                           "avg",
-                           "max",
-                           "min",
-                           "sum",
-                           "value",
                        ] -> null
-                       legend_layout  = "auto" -> null
-                       show_legend    = true -> null
-                       title          = "Updates by Source" -> null
-                       title_align    = "left" -> null
-                       title_size     = "16" -> null

-                       request {
-                           display_type   = "line" -> null
-                           on_right_yaxis = false -> null

-                           formula {
-                               alias              = "FFIS Total" -> null
-                               formula_expression = "cumsum(default_zero(query0))" -> null

-                               style {
-                                   palette       = "classic" -> null
-                                   palette_index = 3 -> null
                                }
                            }
-                           formula {
-                               alias              = "Grants.gov Total" -> null
-                               formula_expression = "cumsum(default_zero(query1))" -> null

-                               style {
-                                   palette       = "classic" -> null
-                                   palette_index = 1 -> null
                                }
                            }
-                           formula {
-                               alias              = "Complete Total" -> null
-                               formula_expression = "cumsum(default_zero(query0)) + cumsum(default_zero(query1))" -> null

-                               style {
-                                   palette       = "classic" -> null
-                                   palette_index = 4 -> null
                                }
                            }

-                           query {
-                               metric_query {
-                                   data_source = "metrics" -> null
-                                   name        = "query0" -> null
-                                   query       = "sum:grants_ingest.PersistFFISData.opportunity.saved{$env,$service,$version}.as_count()" -> null
                                }
                            }
-                           query {
-                               metric_query {
-                                   data_source = "metrics" -> null
-                                   name        = "query1" -> null
-                                   query       = "sum:grants_ingest.PersistGrantsGovXMLDB.opportunity.saved{$env,$service,$version}.as_count()" -> null
                                }
                            }

-                           style {
-                               line_type  = "solid" -> null
-                               line_width = "normal" -> null
-                               palette    = "dog_classic" -> null
                            }
                        }
-                       request {
-                           display_type   = "bars" -> null
-                           on_right_yaxis = false -> null

-                           formula {
-                               alias              = "FFIS Batch" -> null
-                               formula_expression = "query0" -> null

-                               style {
-                                   palette       = "classic" -> null
-                                   palette_index = 3 -> null
                                }
                            }
-                           formula {
-                               alias              = "Grants.gov Batch" -> null
-                               formula_expression = "query1" -> null

-                               style {
-                                   palette       = "classic" -> null
-                                   palette_index = 1 -> null
                                }
                            }

-                           query {
-                               metric_query {
-                                   data_source = "metrics" -> null
-                                   name        = "query0" -> null
-                                   query       = "sum:grants_ingest.PersistFFISData.opportunity.saved{$env,$service,$version}.as_count()" -> null
                                }
                            }
-                           query {
-                               metric_query {
-                                   data_source = "metrics" -> null
-                                   name        = "query1" -> null
-                                   query       = "sum:grants_ingest.PersistGrantsGovXMLDB.opportunity.saved{$env,$service,$version}.as_count()" -> null
                                }
                            }

-                           style {
-                               line_type  = "solid" -> null
-                               line_width = "normal" -> null
-                               palette    = "dog_classic" -> null
                            }
                        }

-                       yaxis {
-                           include_zero = false -> null
-                           scale        = "sqrt" -> null
                        }
                    }

-                   widget_layout {
-                       height          = 4 -> null
-                       is_column_break = false -> null
-                       width           = 8 -> null
-                       x               = 4 -> null
-                       y               = 13 -> null
                    }
                }
-               widget {
-                   id = 1580995608162000 -> null

-                   timeseries_definition {
-                       legend_columns = [
-                           "avg",
-                           "max",
-                           "min",
-                           "sum",
-                           "value",
                        ] -> null
-                       legend_layout  = "auto" -> null
-                       show_legend    = true -> null
-                       title          = "Source Updates vs Published Discrepancy" -> null
-                       title_align    = "left" -> null
-                       title_size     = "16" -> null

-                       request {
-                           display_type   = "line" -> null
-                           on_right_yaxis = false -> null

-                           formula {
-                               alias              = "Updates In" -> null
-                               formula_expression = "cumsum(default_zero(query0)) + cumsum(default_zero(query1))" -> null

-                               style {
-                                   palette       = "classic" -> null
-                                   palette_index = 4 -> null
                                }
                            }
-                           formula {
-                               alias              = "Published Out" -> null
-                               formula_expression = "-cumsum(default_zero(query2))" -> null

-                               style {
-                                   palette       = "green" -> null
-                                   palette_index = 4 -> null
                                }
                            }
-                           formula {
-                               alias              = "Discrepancy" -> null
-                               formula_expression = "(cumsum(default_zero(query0)) + cumsum(default_zero(query1))) - cumsum(default_zero(query2))" -> null

-                               style {
-                                   palette       = "warm" -> null
-                                   palette_index = 5 -> null
                                }
                            }

-                           query {
-                               metric_query {
-                                   data_source = "metrics" -> null
-                                   name        = "query0" -> null
-                                   query       = "sum:grants_ingest.PersistFFISData.opportunity.saved{$env,$service,$version}.as_count()" -> null
                                }
                            }
-                           query {
-                               metric_query {
-                                   data_source = "metrics" -> null
-                                   name        = "query1" -> null
-                                   query       = "sum:grants_ingest.PersistGrantsGovXMLDB.opportunity.saved{$env,$service,$version}.as_count()" -> null
                                }
                            }
-                           query {
-                               metric_query {
-                                   data_source = "metrics" -> null
-                                   name        = "query2" -> null
-                                   query       = "sum:grants_ingest.PublishGrantEvents.event.published{$env,$service,$version}.as_count()" -> null
                                }
                            }

-                           style {
-                               line_type  = "solid" -> null
-                               line_width = "normal" -> null
-                               palette    = "dog_classic" -> null
                            }
                        }

-                       yaxis {
-                           include_zero = false -> null
-                           scale        = "linear" -> null
                        }
                    }

-                   widget_layout {
-                       height          = 4 -> null
-                       is_column_break = false -> null
-                       width           = 4 -> null
-                       x               = 0 -> null
-                       y               = 17 -> null
                    }
                }
-               widget {
-                   id = 889732477923436 -> null

-                   timeseries_definition {
-                       legend_columns = [
-                           "avg",
-                           "max",
-                           "min",
-                           "sum",
-                           "value",
                        ] -> null
-                       legend_layout  = "auto" -> null
-                       show_legend    = true -> null
-                       title          = "Published Events" -> null
-                       title_align    = "left" -> null
-                       title_size     = "16" -> null

-                       request {
-                           display_type   = "line" -> null
-                           on_right_yaxis = false -> null

-                           formula {
-                               alias              = "Total" -> null
-                               formula_expression = "cumsum(default_zero(query0))" -> null

-                               style {
-                                   palette       = "green" -> null
-                                   palette_index = 4 -> null
                                }
                            }

-                           query {
-                               metric_query {
-                                   data_source = "metrics" -> null
-                                   name        = "query0" -> null
-                                   query       = "sum:grants_ingest.PublishGrantEvents.event.published{$env,$service,$version}.as_count()" -> null
                                }
                            }

-                           style {
-                               line_type  = "solid" -> null
-                               line_width = "normal" -> null
-                               palette    = "dog_classic" -> null
                            }
                        }
-                       request {
-                           display_type   = "bars" -> null
-                           on_right_yaxis = false -> null

-                           formula {
-                               alias              = "Events" -> null
-                               formula_expression = "query0" -> null

-                               style {
-                                   palette       = "green" -> null
-                                   palette_index = 4 -> null
                                }
                            }

-                           query {
-                               metric_query {
-                                   data_source = "metrics" -> null
-                                   name        = "query0" -> null
-                                   query       = "sum:grants_ingest.PublishGrantEvents.event.published{$env,$service,$version}.as_count()" -> null
                                }
                            }

-                           style {
-                               line_type  = "solid" -> null
-                               line_width = "normal" -> null
-                               palette    = "dog_classic" -> null
                            }
                        }

-                       yaxis {
-                           include_zero = false -> null
-                           scale        = "sqrt" -> null
                        }
                    }

-                   widget_layout {
-                       height          = 4 -> null
-                       is_column_break = false -> null
-                       width           = 8 -> null
-                       x               = 4 -> null
-                       y               = 17 -> null
                    }
                }

                # (6 unchanged blocks hidden)
            }

          ~ widget_layout {
              ~ height          = 22 -> 13
-               is_column_break = true -> null
              ~ y               = 38 -> 30
                # (2 unchanged attributes hidden)
            }
        }
      ~ widget {
            id = 540494537805434

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 60 -> 43
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 8217916492551692

          ~ widget_layout {
              ~ height          = 7 -> 6
              ~ y               = 64 -> 46
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 7158829887932630

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 71 -> 52
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
    }

  # datadog_metric_metadata.custom["grants_ingest.DownloadFFISSpreadsheet.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadFFISSpreadsheet.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.ExtractGrantsGovDBToXML.xml.extracted"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.ExtractGrantsGovDBToXML.xml.extracted"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.ExtractGrantsGovDBToXML.xml.uploaded"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.ExtractGrantsGovDBToXML.xml.uploaded"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PersistFFISData.opportunity.saved"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PersistFFISData.opportunity.saved"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PersistGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PersistGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PersistGrantsGovXMLDB.opportunity.saved"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PersistGrantsGovXMLDB.opportunity.saved"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.event.published"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.event.published"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.grant_data.invalid"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.grant_data.invalid"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.invocation_batch_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.invocation_batch_size"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.item_image.build"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.item_image.build"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.item_image.malformatted_field"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.item_image.malformatted_field"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.record.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.record.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitFFISSpreadsheet.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitFFISSpreadsheet.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitFFISSpreadsheet.spreadsheet.row_count"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitFFISSpreadsheet.spreadsheet.row_count"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "085a33e4c23645cb6e563ec5daee9e57-3" -> (known after apply)
      ~ id                     = "f2fa51a884d16829959d2fa274cc932d.zip" -> (known after apply)
      ~ key                    = "f2fa51a884d16829959d2fa274cc932d.zip" -> "b9251f64981e02308e8de2cb72217b2e.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "DaVoZe3Wco5M7KRGw7.hHV3ucwsQVLfW" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-09-06T01:57:40.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadFFISSpreadsheet:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadFFISSpreadsheet:6/invocations" -> (known after apply)
      ~ s3_key                         = "f2fa51a884d16829959d2fa274cc932d.zip" -> "b9251f64981e02308e8de2cb72217b2e.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:3f02a3312cff83e9f55aed4531228bb9ee75382a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:e4cc8ea22c3b26e3417640e9867d915264b5c388,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "3f02a3312cff83e9f55aed4531228bb9ee75382a" -> "e4cc8ea22c3b26e3417640e9867d915264b5c388"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "6" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "a8808a1c89d51ecb03b4823fabe29d55-3" -> (known after apply)
      ~ id                     = "f3e974246525f8b1933a57c924482fe7.zip" -> (known after apply)
      ~ key                    = "f3e974246525f8b1933a57c924482fe7.zip" -> "1f6f188d4a7e0e3acb97a5e0315e76a4.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "bI.VJOdcEfQ.HXuaw432BA8SliVXAhrv" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-09-06T01:57:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadGrantsGovDB:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadGrantsGovDB:6/invocations" -> (known after apply)
      ~ s3_key                         = "f3e974246525f8b1933a57c924482fe7.zip" -> "1f6f188d4a7e0e3acb97a5e0315e76a4.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:3f02a3312cff83e9f55aed4531228bb9ee75382a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:e4cc8ea22c3b26e3417640e9867d915264b5c388,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "3f02a3312cff83e9f55aed4531228bb9ee75382a" -> "e4cc8ea22c3b26e3417640e9867d915264b5c388"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "6" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "46d2df78ddbe75bf123f2251a4c01e73-3" -> (known after apply)
      ~ id                     = "442654a752767c99f2ddc7d1ab5dfece.zip" -> (known after apply)
      ~ key                    = "442654a752767c99f2ddc7d1ab5dfece.zip" -> "92b6c4d23b4ceaa4ab6dcb8a0e94f6b4.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "qdKkYvMJS3aHrQjlvd8778IgrROVvU99" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-EnqueueFFISDownload"
      ~ last_modified                  = "2023-09-06T01:57:38.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-EnqueueFFISDownload:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-EnqueueFFISDownload:6/invocations" -> (known after apply)
      ~ s3_key                         = "442654a752767c99f2ddc7d1ab5dfece.zip" -> "92b6c4d23b4ceaa4ab6dcb8a0e94f6b4.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:3f02a3312cff83e9f55aed4531228bb9ee75382a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:e4cc8ea22c3b26e3417640e9867d915264b5c388,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "3f02a3312cff83e9f55aed4531228bb9ee75382a" -> "e4cc8ea22c3b26e3417640e9867d915264b5c388"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "6" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "f721725bd8cedc176894af95988decad-3" -> (known after apply)
      ~ id                     = "aa84d1382cffd728288dad7a7ef2dd53.zip" -> (known after apply)
      ~ key                    = "aa84d1382cffd728288dad7a7ef2dd53.zip" -> "1def92691bd0e3768a5a95d9c9733ed4.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "K3RKW.hBYLgT4YhuVcHCvRrjEb1qWGNB" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-09-06T01:57:41.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ExtractGrantsGovDBToXML:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ExtractGrantsGovDBToXML:6/invocations" -> (known after apply)
      ~ s3_key                         = "aa84d1382cffd728288dad7a7ef2dd53.zip" -> "1def92691bd0e3768a5a95d9c9733ed4.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:3f02a3312cff83e9f55aed4531228bb9ee75382a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:e4cc8ea22c3b26e3417640e9867d915264b5c388,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "3f02a3312cff83e9f55aed4531228bb9ee75382a" -> "e4cc8ea22c3b26e3417640e9867d915264b5c388"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "6" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "a0d52c31ec35fd9e611223790f31c45a-3" -> (known after apply)
      ~ id                     = "e01b7256787eb619082439b0161b27c2.zip" -> (known after apply)
      ~ key                    = "e01b7256787eb619082439b0161b27c2.zip" -> "92acd69ded8ff7d60d8d0dc0944d2a35.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "07oRG05b54KB2wJtjBjW1lcJNxysOvAL" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistFFISData"
      ~ last_modified                  = "2023-09-06T01:57:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistFFISData:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistFFISData:6/invocations" -> (known after apply)
      ~ s3_key                         = "e01b7256787eb619082439b0161b27c2.zip" -> "92acd69ded8ff7d60d8d0dc0944d2a35.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:3f02a3312cff83e9f55aed4531228bb9ee75382a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:e4cc8ea22c3b26e3417640e9867d915264b5c388,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "3f02a3312cff83e9f55aed4531228bb9ee75382a" -> "e4cc8ea22c3b26e3417640e9867d915264b5c388"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "6" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "2831da7f422f273af243e7d673f63da3-3" -> (known after apply)
      ~ id                     = "649a8a781da5b6c2a96cfcf9991fbfd9.zip" -> (known after apply)
      ~ key                    = "649a8a781da5b6c2a96cfcf9991fbfd9.zip" -> "75403f52548d29b1eca71914fe762b8d.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "3w06vTxoIEMa9mbYVj6F7phjE2.uWtFo" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-09-06T01:57:40.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistGrantsGovXMLDB:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistGrantsGovXMLDB:6/invocations" -> (known after apply)
      ~ s3_key                         = "649a8a781da5b6c2a96cfcf9991fbfd9.zip" -> "75403f52548d29b1eca71914fe762b8d.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:3f02a3312cff83e9f55aed4531228bb9ee75382a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:e4cc8ea22c3b26e3417640e9867d915264b5c388,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "3f02a3312cff83e9f55aed4531228bb9ee75382a" -> "e4cc8ea22c3b26e3417640e9867d915264b5c388"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "6" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "4e04fd9f8b6b18bba54c1ee710411ba1-3" -> (known after apply)
      ~ id                     = "140693dccdc12123eed3188e1b2b726e.zip" -> (known after apply)
      ~ key                    = "140693dccdc12123eed3188e1b2b726e.zip" -> "f26149201f7f623eec1dae95e3198bcd.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "IDL8xY5NTA.svWplpVMaxsnBa.ipxLvk" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PublishGrantEvents"
      ~ last_modified                  = "2023-09-06T01:57:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PublishGrantEvents:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PublishGrantEvents:6/invocations" -> (known after apply)
      ~ s3_key                         = "140693dccdc12123eed3188e1b2b726e.zip" -> "f26149201f7f623eec1dae95e3198bcd.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:3f02a3312cff83e9f55aed4531228bb9ee75382a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents" -> "git.commit.sha:e4cc8ea22c3b26e3417640e9867d915264b5c388,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents"
              ~ "DD_VERSION"                   = "3f02a3312cff83e9f55aed4531228bb9ee75382a" -> "e4cc8ea22c3b26e3417640e9867d915264b5c388"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_permission.current_version_triggers["dynamodb"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "dynamodb" -> (known after apply)
      ~ qualifier           = "6" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "bf9043384b0245ee81e64de52e47b522-3" -> (known after apply)
      ~ id                     = "8fbf4768c7dac863b692c17f3a348800.zip" -> (known after apply)
      ~ key                    = "8fbf4768c7dac863b692c17f3a348800.zip" -> "afcee1d072bccaad2b92093f69ad1942.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "D3.PhhMyawvzdmfK7M0XTWAxKT.hqluB" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ReceiveFFISEmail"
      ~ last_modified                  = "2023-09-06T01:57:38.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ReceiveFFISEmail:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ReceiveFFISEmail:5/invocations" -> (known after apply)
      ~ s3_key                         = "8fbf4768c7dac863b692c17f3a348800.zip" -> "afcee1d072bccaad2b92093f69ad1942.zip"
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:3f02a3312cff83e9f55aed4531228bb9ee75382a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail" -> "git.commit.sha:e4cc8ea22c3b26e3417640e9867d915264b5c388,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail"
              ~ "DD_VERSION"                     = "3f02a3312cff83e9f55aed4531228bb9ee75382a" -> "e4cc8ea22c3b26e3417640e9867d915264b5c388"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "5" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "f67ffc94c3ff49b26c211062686ddb62-3" -> (known after apply)
      ~ id                     = "b7b1b012198577c769843e1a688da3e1.zip" -> (known after apply)
      ~ key                    = "b7b1b012198577c769843e1a688da3e1.zip" -> "92173dfe52de1b9ac8f1aa9d8c8cfb6e.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "JsKpseJKPRZC15vl2LWbLaXNJM9rPd6q" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-09-06T01:57:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitFFISSpreadsheet:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitFFISSpreadsheet:6/invocations" -> (known after apply)
      ~ s3_key                         = "b7b1b012198577c769843e1a688da3e1.zip" -> "92173dfe52de1b9ac8f1aa9d8c8cfb6e.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:3f02a3312cff83e9f55aed4531228bb9ee75382a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:e4cc8ea22c3b26e3417640e9867d915264b5c388,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "3f02a3312cff83e9f55aed4531228bb9ee75382a" -> "e4cc8ea22c3b26e3417640e9867d915264b5c388"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "6" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "f75ed932964263536a1ee10621e12145-3" -> (known after apply)
      ~ id                     = "b9bca01f7c011ecce1a59f54f3c9e6b0.zip" -> (known after apply)
      ~ key                    = "b9bca01f7c011ecce1a59f54f3c9e6b0.zip" -> "c6aa291a8a60a3824880877ea3ebc8c9.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "HMjKptEySTuoKVk7iuBg68kNCixgBXK0" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-09-06T01:57:40.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitGrantsGovXMLDB:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitGrantsGovXMLDB:6/invocations" -> (known after apply)
      ~ s3_key                         = "b9bca01f7c011ecce1a59f54f3c9e6b0.zip" -> "c6aa291a8a60a3824880877ea3ebc8c9.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:3f02a3312cff83e9f55aed4531228bb9ee75382a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:e4cc8ea22c3b26e3417640e9867d915264b5c388,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "3f02a3312cff83e9f55aed4531228bb9ee75382a" -> "e4cc8ea22c3b26e3417640e9867d915264b5c388"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "6" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 20 to add, 30 to change, 20 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/6227816732)*